STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215axx_ca35.h
/******************  Bit definition for BSEC_SIDR register  *******************/
#define BSEC_SIDR_SID_Pos             (0U)
#define BSEC_SIDR_SID_Msk             (0xFFFFFFFFUL << BSEC_SIDR_SID_Pos)      /*!< 0xFFFFFFFF */
#define BSEC_SIDR_SID                 BSEC_SIDR_SID_Msk                       /*!< BSEC size identification */

/******************************************************************************/
/*                                                                            */
/*                                  (CA35SSC)                                 */
/*                                                                            */
/******************************************************************************/
/************  Bit definition for CA35SSC_CHGCLKREQ_RW register  *************/
#define CA35SSC_CHGCLKREQ_RW_ARM_CHGCLKREQ_Pos                   (0U)
#define CA35SSC_CHGCLKREQ_RW_ARM_CHGCLKREQ_Msk                   (0x1UL << CA35SSC_CHGCLKREQ_RW_ARM_CHGCLKREQ_Pos)      /*!< 0x00000001 */
#define CA35SSC_CHGCLKREQ_RW_ARM_CHGCLKREQ                       CA35SSC_CHGCLKREQ_RW_ARM_CHGCLKREQ_Msk                /*!<  */
#define CA35SSC_CHGCLKREQ_RW_ARM_CHGCLKACK_Pos                   (1U)
#define CA35SSC_CHGCLKREQ_RW_ARM_CHGCLKACK_Msk                   (0x1UL << CA35SSC_CHGCLKREQ_RW_ARM_CHGCLKACK_Pos)      /*!< 0x00000002 */
#define CA35SSC_CHGCLKREQ_RW_ARM_CHGCLKACK                       CA35SSC_CHGCLKREQ_RW_ARM_CHGCLKACK_Msk                /*!<  */
#define CA35SSC_CHGCLKREQ_RW_ARM_DIVSEL_Pos                      (16U)
#define CA35SSC_CHGCLKREQ_RW_ARM_DIVSEL_Msk                      (0x1UL << CA35SSC_CHGCLKREQ_RW_ARM_DIVSEL_Pos)         /*!< 0x00010000 */
#define CA35SSC_CHGCLKREQ_RW_ARM_DIVSEL                          CA35SSC_CHGCLKREQ_RW_ARM_DIVSEL_Msk                   /*!<  */
#define CA35SSC_CHGCLKREQ_RW_ARM_DIVSELACK_Pos                   (17U)
#define CA35SSC_CHGCLKREQ_RW_ARM_DIVSELACK_Msk                   (0x1UL << CA35SSC_CHGCLKREQ_RW_ARM_DIVSELACK_Pos)      /*!< 0x00020000 */
#define CA35SSC_CHGCLKREQ_RW_ARM_DIVSELACK                       CA35SSC_CHGCLKREQ_RW_ARM_DIVSELACK_Msk                /*!<  */

/************  Bit definition for CA35SSC_CHGCLKREQ_WS1 register  *************/
#define CA35SSC_CHGCLKREQ_WS1_ARM_CHGCLKREQ_Pos                  (0U)
#define CA35SSC_CHGCLKREQ_WS1_ARM_CHGCLKREQ_Msk                  (0x1UL << CA35SSC_CHGCLKREQ_WS1_ARM_CHGCLKREQ_Pos)     /*!< 0x00000001 */
#define CA35SSC_CHGCLKREQ_WS1_ARM_CHGCLKREQ                      CA35SSC_CHGCLKREQ_WS1_ARM_CHGCLKREQ_Msk               /*!<  */
#define CA35SSC_CHGCLKREQ_WS1_ARM_CHGCLKACK_Pos                  (1U)
#define CA35SSC_CHGCLKREQ_WS1_ARM_CHGCLKACK_Msk                  (0x1UL << CA35SSC_CHGCLKREQ_WS1_ARM_CHGCLKACK_Pos)     /*!< 0x00000002 */
#define CA35SSC_CHGCLKREQ_WS1_ARM_CHGCLKACK                      CA35SSC_CHGCLKREQ_WS1_ARM_CHGCLKACK_Msk               /*!<  */
#define CA35SSC_CHGCLKREQ_WS1_ARM_DIVSEL_Pos                     (16U)
#define CA35SSC_CHGCLKREQ_WS1_ARM_DIVSEL_Msk                     (0x1UL << CA35SSC_CHGCLKREQ_WS1_ARM_DIVSEL_Pos)        /*!< 0x00010000 */
#define CA35SSC_CHGCLKREQ_WS1_ARM_DIVSEL                         CA35SSC_CHGCLKREQ_WS1_ARM_DIVSEL_Msk                  /*!<  */
#define CA35SSC_CHGCLKREQ_WS1_ARM_DIVSELACK_Pos                  (17U)
#define CA35SSC_CHGCLKREQ_WS1_ARM_DIVSELACK_Msk                  (0x1UL << CA35SSC_CHGCLKREQ_WS1_ARM_DIVSELACK_Pos)     /*!< 0x00020000 */
#define CA35SSC_CHGCLKREQ_WS1_ARM_DIVSELACK                      CA35SSC_CHGCLKREQ_WS1_ARM_DIVSELACK_Msk               /*!<  */

/************  Bit definition for CA35SSC_CHGCLKREQ_WC1 register  *************/
#define CA35SSC_CHGCLKREQ_WC1_ARM_CHGCLKREQ_Pos                  (0U)
#define CA35SSC_CHGCLKREQ_WC1_ARM_CHGCLKREQ_Msk                  (0x1UL << CA35SSC_CHGCLKREQ_WC1_ARM_CHGCLKREQ_Pos)     /*!< 0x00000001 */
#define CA35SSC_CHGCLKREQ_WC1_ARM_CHGCLKREQ                      CA35SSC_CHGCLKREQ_WC1_ARM_CHGCLKREQ_Msk               /*!<  */
#define CA35SSC_CHGCLKREQ_WC1_ARM_CHGCLKACK_Pos                  (1U)
#define CA35SSC_CHGCLKREQ_WC1_ARM_CHGCLKACK_Msk                  (0x1UL << CA35SSC_CHGCLKREQ_WC1_ARM_CHGCLKACK_Pos)     /*!< 0x00000002 */
#define CA35SSC_CHGCLKREQ_WC1_ARM_CHGCLKACK                      CA35SSC_CHGCLKREQ_WC1_ARM_CHGCLKACK_Msk               /*!<  */
#define CA35SSC_CHGCLKREQ_WC1_ARM_DIVSEL_Pos                     (16U)
#define CA35SSC_CHGCLKREQ_WC1_ARM_DIVSEL_Msk                     (0x1UL << CA35SSC_CHGCLKREQ_WC1_ARM_DIVSEL_Pos)        /*!< 0x00010000 */
#define CA35SSC_CHGCLKREQ_WC1_ARM_DIVSEL                         CA35SSC_CHGCLKREQ_WC1_ARM_DIVSEL_Msk                  /*!<  */
#define CA35SSC_CHGCLKREQ_WC1_ARM_DIVSELACK_Pos                  (17U)
#define CA35SSC_CHGCLKREQ_WC1_ARM_DIVSELACK_Msk                  (0x1UL << CA35SSC_CHGCLKREQ_WC1_ARM_DIVSELACK_Pos)     /*!< 0x00020000 */
#define CA35SSC_CHGCLKREQ_WC1_ARM_DIVSELACK                      CA35SSC_CHGCLKREQ_WC1_ARM_DIVSELACK_Msk               /*!<  */

/************  Bit definition for CA35SSC_CHGCLKREQ_WT1 register  *************/
#define CA35SSC_CHGCLKREQ_WT1_ARM_CHGCLKREQ_Pos                  (0U)
#define CA35SSC_CHGCLKREQ_WT1_ARM_CHGCLKREQ_Msk                  (0x1UL << CA35SSC_CHGCLKREQ_WT1_ARM_CHGCLKREQ_Pos)     /*!< 0x00000001 */
#define CA35SSC_CHGCLKREQ_WT1_ARM_CHGCLKREQ                      CA35SSC_CHGCLKREQ_WT1_ARM_CHGCLKREQ_Msk               /*!<  */
#define CA35SSC_CHGCLKREQ_WT1_ARM_CHGCLKACK_Pos                  (1U)
#define CA35SSC_CHGCLKREQ_WT1_ARM_CHGCLKACK_Msk                  (0x1UL << CA35SSC_CHGCLKREQ_WT1_ARM_CHGCLKACK_Pos)     /*!< 0x00000002 */
#define CA35SSC_CHGCLKREQ_WT1_ARM_CHGCLKACK                      CA35SSC_CHGCLKREQ_WT1_ARM_CHGCLKACK_Msk               /*!<  */
#define CA35SSC_CHGCLKREQ_WT1_ARM_DIVSEL_Pos                     (16U)
#define CA35SSC_CHGCLKREQ_WT1_ARM_DIVSEL_Msk                     (0x1UL << CA35SSC_CHGCLKREQ_WT1_ARM_DIVSEL_Pos)        /*!< 0x00010000 */
#define CA35SSC_CHGCLKREQ_WT1_ARM_DIVSEL                         CA35SSC_CHGCLKREQ_WT1_ARM_DIVSEL_Msk                  /*!<  */
#define CA35SSC_CHGCLKREQ_WT1_ARM_DIVSELACK_Pos                  (17U)
#define CA35SSC_CHGCLKREQ_WT1_ARM_DIVSELACK_Msk                  (0x1UL << CA35SSC_CHGCLKREQ_WT1_ARM_DIVSELACK_Pos)     /*!< 0x00020000 */
#define CA35SSC_CHGCLKREQ_WT1_ARM_DIVSELACK                      CA35SSC_CHGCLKREQ_WT1_ARM_DIVSELACK_Msk               /*!<  */

