STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215axx_ca35.h
/********  Bit definition for CA35SYSCFG_TRACE_CLK_DIV_CR register  ********/
#define CA35SYSCFG_TRACE_CLK_DIV_CR_TRACE_CLK_DIV_VALUE_Pos      (0U)
#define CA35SYSCFG_TRACE_CLK_DIV_CR_TRACE_CLK_DIV_VALUE_Msk      (0x3FUL << CA35SYSCFG_TRACE_CLK_DIV_CR_TRACE_CLK_DIV_VALUE_Pos)        /*!< 0x0000003F */
#define CA35SYSCFG_TRACE_CLK_DIV_CR_TRACE_CLK_DIV_VALUE          CA35SYSCFG_TRACE_CLK_DIV_CR_TRACE_CLK_DIV_VALUE_Msk   /*!< 0x1 to 0x3F: Divider ratio from 2 to 64 */

/***********  Bit definition for CA35SYSCFG_DBGPWR_CR register  ************/
#define CA35SYSCFG_DBGPWR_CR_DBGPWRUP0_Pos                       (0U)
#define CA35SYSCFG_DBGPWR_CR_DBGPWRUP0_Msk                       (0x1UL << CA35SYSCFG_DBGPWR_CR_DBGPWRUP0_Pos)          /*!< 0x00000001 */
#define CA35SYSCFG_DBGPWR_CR_DBGPWRUP0                           CA35SYSCFG_DBGPWR_CR_DBGPWRUP0_Msk                    /*!<  */
#define CA35SYSCFG_DBGPWR_CR_DBGPWRUP1_Pos                       (1U)
#define CA35SYSCFG_DBGPWR_CR_DBGPWRUP1_Msk                       (0x1UL << CA35SYSCFG_DBGPWR_CR_DBGPWRUP1_Pos)          /*!< 0x00000002 */
#define CA35SYSCFG_DBGPWR_CR_DBGPWRUP1                           CA35SYSCFG_DBGPWR_CR_DBGPWRUP1_Msk                    /*!<  */

/*******  Bit definition for CA35SYSCFG_DBGL1RSTDISABLE_CR register  *******/
#define CA35SYSCFG_DBGL1RSTDISABLE_CR_DBGL1RSTDIS_Pos            (0U)
#define CA35SYSCFG_DBGL1RSTDISABLE_CR_DBGL1RSTDIS_Msk            (0x1UL << CA35SYSCFG_DBGL1RSTDISABLE_CR_DBGL1RSTDIS_Pos) /*!< 0x00000001 */
#define CA35SYSCFG_DBGL1RSTDISABLE_CR_DBGL1RSTDIS                CA35SYSCFG_DBGL1RSTDISABLE_CR_DBGL1RSTDIS_Msk         /*!<  */

/***********  Bit definition for CA35SYSCFG_DBGPWR_SR register  ************/
#define CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN0_Pos                    (0U)
#define CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN0_Msk                    (0x1UL << CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN0_Pos)       /*!< 0x00000001 */
#define CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN0                        CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN0_Msk                 /*!<  */
#define CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN1_Pos                    (1U)
#define CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN1_Msk                    (0x1UL << CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN1_Pos)       /*!< 0x00000002 */
#define CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN1                        CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN1_Msk                 /*!<  */
#define CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ0_Pos                    (2U)
#define CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ0_Msk                    (0x1UL << CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ0_Pos)       /*!< 0x00000004 */
#define CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ0                        CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ0_Msk                 /*!<  */
#define CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ1_Pos                    (3U)
#define CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ1_Msk                    (0x1UL << CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ1_Pos)       /*!< 0x00000008 */
#define CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ1                        CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ1_Msk                 /*!<  */

/***********  Bit definition for CA35SYSCFG_EDBGACK_SR register  ***********/
#define CA35SYSCFG_EDBGACK_SR_DBGACK_C0_Pos                      (0U)
#define CA35SYSCFG_EDBGACK_SR_DBGACK_C0_Msk                      (0x1UL << CA35SYSCFG_EDBGACK_SR_DBGACK_C0_Pos)         /*!< 0x00000001 */
#define CA35SYSCFG_EDBGACK_SR_DBGACK_C0                          CA35SYSCFG_EDBGACK_SR_DBGACK_C0_Msk                   /*!<  */
#define CA35SYSCFG_EDBGACK_SR_DBGACK_C1_Pos                      (1U)
#define CA35SYSCFG_EDBGACK_SR_DBGACK_C1_Msk                      (0x1UL << CA35SYSCFG_EDBGACK_SR_DBGACK_C1_Pos)         /*!< 0x00000002 */
#define CA35SYSCFG_EDBGACK_SR_DBGACK_C1                          CA35SYSCFG_EDBGACK_SR_DBGACK_C1_Msk                   /*!<  */

/************  Bit definition for CA35SYSCFG_GIC_CFGR register  ************/
#define CA35SYSCFG_GIC_CFGR_GIC_4KNOT64K_Pos                     (0U)
#define CA35SYSCFG_GIC_CFGR_GIC_4KNOT64K_Msk                     (0x1UL << CA35SYSCFG_GIC_CFGR_GIC_4KNOT64K_Pos)        /*!< 0x00000001 */
#define CA35SYSCFG_GIC_CFGR_GIC_4KNOT64K                         CA35SYSCFG_GIC_CFGR_GIC_4KNOT64K_Msk                  /*!<  */

/*************  Bit definition for CA35SYSCFG_LP_SR register  **************/
#define CA35SYSCFG_LP_SR_STANDBYWFE_0_Pos                        (0U)
#define CA35SYSCFG_LP_SR_STANDBYWFE_0_Msk                        (0x1UL << CA35SYSCFG_LP_SR_STANDBYWFE_0_Pos)           /*!< 0x00000001 */
#define CA35SYSCFG_LP_SR_STANDBYWFE_0                            CA35SYSCFG_LP_SR_STANDBYWFE_0_Msk                     /*!<  */
#define CA35SYSCFG_LP_SR_STANDBYWFE_1_Pos                        (1U)
#define CA35SYSCFG_LP_SR_STANDBYWFE_1_Msk                        (0x1UL << CA35SYSCFG_LP_SR_STANDBYWFE_1_Pos)           /*!< 0x00000002 */
#define CA35SYSCFG_LP_SR_STANDBYWFE_1                            CA35SYSCFG_LP_SR_STANDBYWFE_1_Msk                     /*!<  */
#define CA35SYSCFG_LP_SR_STANDBYWFI_0_Pos                        (2U)
#define CA35SYSCFG_LP_SR_STANDBYWFI_0_Msk                        (0x1UL << CA35SYSCFG_LP_SR_STANDBYWFI_0_Pos)           /*!< 0x00000004 */
#define CA35SYSCFG_LP_SR_STANDBYWFI_0                            CA35SYSCFG_LP_SR_STANDBYWFI_0_Msk                     /*!<  */
#define CA35SYSCFG_LP_SR_STANDBYWFI_1_Pos                        (3U)
#define CA35SYSCFG_LP_SR_STANDBYWFI_1_Msk                        (0x1UL << CA35SYSCFG_LP_SR_STANDBYWFI_1_Pos)           /*!< 0x00000008 */
#define CA35SYSCFG_LP_SR_STANDBYWFI_1                            CA35SYSCFG_LP_SR_STANDBYWFI_1_Msk                     /*!<  */
#define CA35SYSCFG_LP_SR_STANDBYWFIL2_Pos                        (4U)
#define CA35SYSCFG_LP_SR_STANDBYWFIL2_Msk                        (0x1UL << CA35SYSCFG_LP_SR_STANDBYWFIL2_Pos)           /*!< 0x00000010 */
#define CA35SYSCFG_LP_SR_STANDBYWFIL2                            CA35SYSCFG_LP_SR_STANDBYWFIL2_Msk                     /*!<  */

/***********  Bit definition for CA35SYSCFG_RSTACK_SR register  ************/
#define CA35SYSCFG_RSTACK_SR_NRESET_DBG_ACK_Pos                  (0U)
#define CA35SYSCFG_RSTACK_SR_NRESET_DBG_ACK_Msk                  (0x1UL << CA35SYSCFG_RSTACK_SR_NRESET_DBG_ACK_Pos)     /*!< 0x00000001 */
#define CA35SYSCFG_RSTACK_SR_NRESET_DBG_ACK                      CA35SYSCFG_RSTACK_SR_NRESET_DBG_ACK_Msk               /*!<  */
#define CA35SYSCFG_RSTACK_SR_NRESET_FCT_ACK_Pos                  (1U)
#define CA35SYSCFG_RSTACK_SR_NRESET_FCT_ACK_Msk                  (0x1UL << CA35SYSCFG_RSTACK_SR_NRESET_FCT_ACK_Pos)     /*!< 0x00000002 */
#define CA35SYSCFG_RSTACK_SR_NRESET_FCT_ACK                      CA35SYSCFG_RSTACK_SR_NRESET_FCT_ACK_Msk               /*!<  */

/*********  Bit definition for CA35SYSCFG_AARCH_MODE_CR register  **********/
#define CA35SYSCFG_AARCH_MODE_CR_AA64NAA32_Pos                   (0U)
#define CA35SYSCFG_AARCH_MODE_CR_AA64NAA32_Msk                   (0x1UL << CA35SYSCFG_AARCH_MODE_CR_AA64NAA32_Pos)      /*!< 0x00000001 */
#define CA35SYSCFG_AARCH_MODE_CR_AA64NAA32                       CA35SYSCFG_AARCH_MODE_CR_AA64NAA32_Msk                /*!<  */

/************  Bit definition for CA35SYSCFG_VBAR_CR register  *************/
#define CA35SYSCFG_VBAR_CR_RVBARADDRL_Pos                        (2U)
#define CA35SYSCFG_VBAR_CR_RVBARADDRL_Msk                        (0x3FFFFFFFUL << CA35SYSCFG_VBAR_CR_RVBARADDRL_Pos)    /*!< 0xFFFFFFFC */
#define CA35SYSCFG_VBAR_CR_RVBARADDRL                            CA35SYSCFG_VBAR_CR_RVBARADDRL_Msk                     /*!< Set the value of reset vector at the boundaries of the Cortex-A35 cores */

/*********  Bit definition for CA35SYSCFG_M33_ACCESS_CR register  **********/
#define CA35SYSCFG_M33_ACCESS_CR_M33CFG_SEC_Pos                  (0U)
#define CA35SYSCFG_M33_ACCESS_CR_M33CFG_SEC_Msk                  (0x1UL << CA35SYSCFG_M33_ACCESS_CR_M33CFG_SEC_Pos)     /*!< 0x00000001 */
#define CA35SYSCFG_M33_ACCESS_CR_M33CFG_SEC                      CA35SYSCFG_M33_ACCESS_CR_M33CFG_SEC_Msk               /*!<  */
#define CA35SYSCFG_M33_ACCESS_CR_M33CFG_PRIV_Pos                 (1U)
#define CA35SYSCFG_M33_ACCESS_CR_M33CFG_PRIV_Msk                 (0x1UL << CA35SYSCFG_M33_ACCESS_CR_M33CFG_PRIV_Pos)    /*!< 0x00000002 */
#define CA35SYSCFG_M33_ACCESS_CR_M33CFG_PRIV                     CA35SYSCFG_M33_ACCESS_CR_M33CFG_PRIV_Msk              /*!<  */

/**********  Bit definition for CA35SYSCFG_M33_TZEN_CR register  ***********/
#define CA35SYSCFG_M33_TZEN_CR_CFG_SECEXT_Pos                    (0U)
#define CA35SYSCFG_M33_TZEN_CR_CFG_SECEXT_Msk                    (0x1UL << CA35SYSCFG_M33_TZEN_CR_CFG_SECEXT_Pos)       /*!< 0x00000001 */
#define CA35SYSCFG_M33_TZEN_CR_CFG_SECEXT                        CA35SYSCFG_M33_TZEN_CR_CFG_SECEXT_Msk                 /*!<  */

/********  Bit definition for CA35SYSCFG_M33_INITSVTOR_CR register  ********/
#define CA35SYSCFG_M33_INITSVTOR_CR_INITSVTOR_Pos                (7U)
#define CA35SYSCFG_M33_INITSVTOR_CR_INITSVTOR_Msk                (0x1FFFFFFUL << CA35SYSCFG_M33_INITSVTOR_CR_INITSVTOR_Pos)   /*!< 0xFFFFFF80 */
#define CA35SYSCFG_M33_INITSVTOR_CR_INITSVTOR                    CA35SYSCFG_M33_INITSVTOR_CR_INITSVTOR_Msk             /*!< Secure vector table offset */

/*******  Bit definition for CA35SYSCFG_M33_INITNSVTOR_CR register  ********/
#define CA35SYSCFG_M33_INITNSVTOR_CR_INITNSVTOR_Pos              (7U)
#define CA35SYSCFG_M33_INITNSVTOR_CR_INITNSVTOR_Msk              (0x1FFFFFFUL << CA35SYSCFG_M33_INITNSVTOR_CR_INITNSVTOR_Pos)     /*!< 0xFFFFFF80 */
#define CA35SYSCFG_M33_INITNSVTOR_CR_INITNSVTOR                  CA35SYSCFG_M33_INITNSVTOR_CR_INITNSVTOR_Msk           /*!< Non-secure vector table offset */

/*************  Bit definition for CA35SYSCFG_VERR register  ***************/
#define CA35SYSCFG_VERR_MINREV_Pos                               (0U)
#define CA35SYSCFG_VERR_MINREV_Msk                               (0xFUL << CA35SYSCFG_VERR_MINREV_Pos)                  /*!< 0x0000000F */
#define CA35SYSCFG_VERR_MINREV                                   CA35SYSCFG_VERR_MINREV_Msk                            /*!< minor revision information */
#define CA35SYSCFG_VERR_MAJREV_Pos                               (4U)
#define CA35SYSCFG_VERR_MAJREV_Msk                               (0xFUL << CA35SYSCFG_VERR_MAJREV_Pos)                  /*!< 0x000000F0 */
#define CA35SYSCFG_VERR_MAJREV                                    CA35SYSCFG_VERR_MAJREV_Msk                           /*!< major revision information */

/*************  Bit definition for CA35SYSCFG_IPIDR register  **************/
#define CA35SYSCFG_IPIDR_ID_Pos                                  (0U)
#define CA35SYSCFG_IPIDR_ID_Msk                                  (0xFFFFFFFFUL << CA35SYSCFG_IPIDR_ID_Pos)              /*!< 0xFFFFFFFF */
#define CA35SYSCFG_IPIDR_ID                                      CA35SYSCFG_IPIDR_ID_Msk                               /*!< BSEC identification */

/*************  Bit definition for CA35SYSCFG_SIDR register  ***************/
#define CA35SYSCFG_SIDR_SID_Pos                                  (0U)
#define CA35SYSCFG_SIDR_SID_Msk                                  (0xFFFFFFFFUL << CA35SYSCFG_SIDR_SID_Pos)              /*!< 0xFFFFFFFF */
#define CA35SYSCFG_SIDR_SID                                      CA35SYSCFG_SIDR_SID_Msk                               /*!< BSEC size identification */

/******************************************************************************/
/*                                                                            */
/*                          CRC calculation unit                              */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for CRC_DR register  *********************/
#define CRC_DR_DR_Pos            (0U)
#define CRC_DR_DR_Msk            (0xFFFFFFFFUL << CRC_DR_DR_Pos)                /*!< 0xFFFFFFFF */
#define CRC_DR_DR                CRC_DR_DR_Msk                                 /*!< Data register bits */

/*******************  Bit definition for CRC_IDR register  ********************/
#define CRC_IDR_IDR_Pos          (0U)
#define CRC_IDR_IDR_Msk          (0xFFFFFFFFUL << CRC_IDR_IDR_Pos)              /*!< 0xFFFFFFFF */
#define CRC_IDR_IDR              CRC_IDR_IDR_Msk                               /*!< General-purpose 32-bit data register bits */

/********************  Bit definition for CRC_CR register  ********************/
#define CRC_CR_RESET_Pos         (0U)
#define CRC_CR_RESET_Msk         (0x1UL << CRC_CR_RESET_Pos)                    /*!< 0x00000001 */
#define CRC_CR_RESET             CRC_CR_RESET_Msk                              /*!< RESET the CRC computation unit bit */
#define CRC_CR_POLYSIZE_Pos      (3U)
#define CRC_CR_POLYSIZE_Msk      (0x3UL << CRC_CR_POLYSIZE_Pos)                 /*!< 0x00000018 */
#define CRC_CR_POLYSIZE          CRC_CR_POLYSIZE_Msk                           /*!< Polynomial size bits */
#define CRC_CR_POLYSIZE_0        (0x1UL << CRC_CR_POLYSIZE_Pos)                 /*!< 0x00000008 */
#define CRC_CR_POLYSIZE_1        (0x2UL << CRC_CR_POLYSIZE_Pos)                 /*!< 0x00000010 */
#define CRC_CR_REV_IN_Pos        (5U)
#define CRC_CR_REV_IN_Msk        (0x3UL << CRC_CR_REV_IN_Pos)                   /*!< 0x00000060 */
#define CRC_CR_REV_IN            CRC_CR_REV_IN_Msk                             /*!< REV_IN Reverse Input Data bits */
#define CRC_CR_REV_IN_0          (0x1UL << CRC_CR_REV_IN_Pos)                   /*!< 0x00000020 */
#define CRC_CR_REV_IN_1          (0x2UL << CRC_CR_REV_IN_Pos)                   /*!< 0x00000040 */
#define CRC_CR_REV_OUT_Pos       (7U)
#define CRC_CR_REV_OUT_Msk       (0x3UL << CRC_CR_REV_OUT_Pos)                  /*!< 0x00000080 */
#define CRC_CR_REV_OUT           CRC_CR_REV_OUT_Msk                            /*!< REV_OUT Reverse Output Data bits */
#define CRC_CR_REV_OUT_0         (0x1UL << CRC_CR_REV_OUT_Pos)
#define CRC_CR_REV_OUT_1         (0x2UL << CRC_CR_REV_OUT_Pos)
#define CRC_CR_RTYPE_IN_Pos      (9U)
#define CRC_CR_RTYPE_IN_Msk      (0x1UL << CRC_CR_RTYPE_IN_Pos)
#define CRC_CR_RTYPE_IN          CRC_CR_RTYPE_IN_Msk
#define CRC_CR_RTYPE_OUT_Pos     (10U)
#define CRC_CR_RTYPE_OUT_Msk     (0x1UL << CRC_CR_RTYPE_OUT_Pos)
#define CRC_CR_RTYPE_OUT         CRC_CR_RTYPE_OUT_Msk

/*******************  Bit definition for CRC_INIT register  *******************/
#define CRC_INIT_INIT_Pos        (0U)
#define CRC_INIT_INIT_Msk        (0xFFFFFFFFUL << CRC_INIT_INIT_Pos)            /*!< 0xFFFFFFFF */
#define CRC_INIT_INIT            CRC_INIT_INIT_Msk                             /*!< Initial CRC value bits */

/*******************  Bit definition for CRC_POL register  ********************/
#define CRC_POL_POL_Pos          (0U)
#define CRC_POL_POL_Msk          (0xFFFFFFFFUL << CRC_POL_POL_Pos)              /*!< 0xFFFFFFFF */
#define CRC_POL_POL              CRC_POL_POL_Msk                               /*!< Coefficients of the polynomial */

