STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215axx_ca35.h
/****************  Bit definition for OCTOSPI_WIR register  *******************/
#define OCTOSPI_WIR_INSTRUCTION_Pos    (0U)
#define OCTOSPI_WIR_INSTRUCTION_Msk    (0xFFFFFFFFUL << OCTOSPI_WIR_INSTRUCTION_Pos) /*!< 0xFFFFFFFF */
#define OCTOSPI_WIR_INSTRUCTION        OCTOSPI_WIR_INSTRUCTION_Msk             /*!< Instruction */

/****************  Bit definition for OCTOSPI_WABR register  ******************/
#define OCTOSPI_WABR_ALTERNATE_Pos     (0U)
#define OCTOSPI_WABR_ALTERNATE_Msk     (0xFFFFFFFFUL << OCTOSPI_WABR_ALTERNATE_Pos) /*!< 0xFFFFFFFF */
#define OCTOSPI_WABR_ALTERNATE         OCTOSPI_WABR_ALTERNATE_Msk              /*!< Alternate Bytes */

/****************  Bit definition for OCTOSPI_HLCR register  ******************/
#define OCTOSPI_HLCR_LM_Pos            (0U)
#define OCTOSPI_HLCR_LM_Msk            (0x1UL << OCTOSPI_HLCR_LM_Pos)           /*!< 0x00000001 */
#define OCTOSPI_HLCR_LM                OCTOSPI_HLCR_LM_Msk                     /*!< Latency Mode */
#define OCTOSPI_HLCR_WZL_Pos           (1U)
#define OCTOSPI_HLCR_WZL_Msk           (0x1UL << OCTOSPI_HLCR_WZL_Pos)          /*!< 0x00000002 */
#define OCTOSPI_HLCR_WZL               OCTOSPI_HLCR_WZL_Msk                    /*!< Write Zero Latency */
#define OCTOSPI_HLCR_TACC_Pos          (8U)
#define OCTOSPI_HLCR_TACC_Msk          (0xFFUL << OCTOSPI_HLCR_TACC_Pos)        /*!< 0x0000FF00 */
#define OCTOSPI_HLCR_TACC              OCTOSPI_HLCR_TACC_Msk                   /*!< Access Time */
#define OCTOSPI_HLCR_TRWR_Pos          (16U)
#define OCTOSPI_HLCR_TRWR_Msk          (0xFFUL << OCTOSPI_HLCR_TRWR_Pos)        /*!< 0x00FF0000 */
#define OCTOSPI_HLCR_TRWR              OCTOSPI_HLCR_TRWR_Msk                   /*!< Read Write Recovery Time */

/***************  Bit definition for OCTOSPI_HWCFGR2 register  ****************/
#define OCTOSPI_HWCFGR2_FRCK_Pos         (0U)
#define OCTOSPI_HWCFGR2_FRCK_Msk         (0xFUL << OCTOSPI_HWCFGR2_FRCK_Pos)            /*!< 0x0000000F */
#define OCTOSPI_HWCFGR2_FRCK             OCTOSPI_HWCFGR2_FRCK_Msk                      /*!< Free running clock */
#define OCTOSPI_HWCFGR2_RDFT_Pos         (4U)
#define OCTOSPI_HWCFGR2_RDFT_Msk         (0xFUL << OCTOSPI_HWCFGR2_RDFT_Pos)            /*!< 0x000000F0 */
#define OCTOSPI_HWCFGR2_RDFT             OCTOSPI_HWCFGR2_RDFT_Msk                      /*!< Reduced features */
#define OCTOSPI_HWCFGR2_ARBM_Pos         (8U)
#define OCTOSPI_HWCFGR2_ARBM_Msk         (0xFUL << OCTOSPI_HWCFGR2_ARBM_Pos)            /*!< 0x00000F00 */
#define OCTOSPI_HWCFGR2_ARBM             OCTOSPI_HWCFGR2_ARBM_Msk                      /*!< Arbitration configuration */
#define OCTOSPI_HWCFGR2_MEM16_Pos        (12U)
#define OCTOSPI_HWCFGR2_MEM16_Msk        (0xFUL << OCTOSPI_HWCFGR2_MEM16_Pos)           /*!< 0x0000F000 */
#define OCTOSPI_HWCFGR2_MEM16            OCTOSPI_HWCFGR2_MEM16_Msk                     /*!< Size of the SPI memory supported */
#define OCTOSPI_HWCFGR2_HSINT_Pos        (16U)
#define OCTOSPI_HWCFGR2_HSINT_Msk        (0xFUL << OCTOSPI_HWCFGR2_HSINT_Pos)           /*!< 0x000F0000 */
#define OCTOSPI_HWCFGR2_HSINT            OCTOSPI_HWCFGR2_HSINT_Msk                     /*!< High-speed interface */

/****************  Bit definition for OCTOSPI_HWCFGR register  ****************/
#define OCTOSPI_HWCFGR_AXI_Pos           (0U)
#define OCTOSPI_HWCFGR_AXI_Msk           (0xFUL << OCTOSPI_HWCFGR_AXI_Pos)              /*!< 0x0000000F */
#define OCTOSPI_HWCFGR_AXI               OCTOSPI_HWCFGR_AXI_Msk                        /*!< OCTOSPI interface */
#define OCTOSPI_HWCFGR_FIFO_Pos          (4U)
#define OCTOSPI_HWCFGR_FIFO_Msk          (0xFFUL << OCTOSPI_HWCFGR_FIFO_Pos)            /*!< 0x00000FF0 */
#define OCTOSPI_HWCFGR_FIFO              OCTOSPI_HWCFGR_FIFO_Msk                       /*!< FIFO depth */
#define OCTOSPI_HWCFGR_PRES_Pos          (12U)
#define OCTOSPI_HWCFGR_PRES_Msk          (0xFFUL << OCTOSPI_HWCFGR_PRES_Pos)            /*!< 0x000FF000 */
#define OCTOSPI_HWCFGR_PRES              OCTOSPI_HWCFGR_PRES_Msk                       /*!< Prescaler */
#define OCTOSPI_HWCFGR_IDL_Pos           (20U)
#define OCTOSPI_HWCFGR_IDL_Msk           (0xFUL << OCTOSPI_HWCFGR_IDL_Pos)              /*!< 0x00F00000 */
#define OCTOSPI_HWCFGR_IDL               OCTOSPI_HWCFGR_IDL_Msk                        /*!< ID Length */
#define OCTOSPI_HWCFGR_MMW_Pos           (24U)
#define OCTOSPI_HWCFGR_MMW_Msk           (0xFUL << OCTOSPI_HWCFGR_MMW_Pos)              /*!< 0x0F000000 */
#define OCTOSPI_HWCFGR_MMW               OCTOSPI_HWCFGR_MMW_Msk                        /*!< Memory-mapped write */
#define OCTOSPI_HWCFGR_CSSRV_Pos         (28U)
#define OCTOSPI_HWCFGR_CSSRV_Msk         (0xFUL << OCTOSPI_HWCFGR_CSSRV_Pos)            /*!< 0xF0000000 */
#define OCTOSPI_HWCFGR_CSSRV             OCTOSPI_HWCFGR_CSSRV_Msk                      /*!< CSSEL reset value */

/****************  Bit definition for OCTOSPI_VER register  *******************/
#define OCTOSPI_VER_VER_Pos            (0U)
#define OCTOSPI_VER_VER_Msk            (0xFFUL << OCTOSPI_VER_VER_Pos)          /*!< 0x000000FF */
#define OCTOSPI_VER_VER                OCTOSPI_VER_VER_Msk                     /*!< Version */

/*****************  Bit definition for OCTOSPI_ID register  *******************/
#define OCTOSPI_ID_ID_Pos              (0U)
#define OCTOSPI_ID_ID_Msk              (0xFFFFFFFFUL << OCTOSPI_ID_ID_Pos)      /*!< 0xFFFFFFFF */
#define OCTOSPI_ID_ID                  OCTOSPI_ID_ID_Msk                       /*!< Identification */

/****************  Bit definition for OCTOSPI_MID register  *******************/
#define OCTOSPI_MID_MID_Pos            (0U)
#define OCTOSPI_MID_MID_Msk            (0xFFFFFFFFUL << OCTOSPI_MID_MID_Pos)    /*!< 0xFFFFFFFF */
#define OCTOSPI_MID_MID                OCTOSPI_MID_MID_Msk                     /*!< Magic ID */




/******************************************************************************/
/*                                                                            */
/*                Parallel Synchronous Slave Interface (PSSI )                */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for PSSI_CR register  *******************/
#define PSSI_CR_OUTEN_Pos               (31U)
#define PSSI_CR_OUTEN_Msk               (0x1UL << PSSI_CR_OUTEN_Pos)           /*!< 0x80000000 */
#define PSSI_CR_OUTEN                   PSSI_CR_OUTEN_Msk                      /*!< Data direction selection */
#define PSSI_CR_DMAEN_Pos               (30U)
#define PSSI_CR_DMAEN_Msk               (0x1UL << PSSI_CR_DMAEN_Pos)           /*!< 0x40000000 */
#define PSSI_CR_DMAEN                   PSSI_CR_DMAEN_Msk                      /*!< DMA enable */
#define PSSI_CR_DERDYCFG_Pos            (18U)
#define PSSI_CR_DERDYCFG_Msk            (0x7UL << PSSI_CR_DERDYCFG_Pos)        /*!< 0x001C0000 */
#define PSSI_CR_DERDYCFG                PSSI_CR_DERDYCFG_Msk                   /*!< Data enable and ready configuration */
#define PSSI_CR_ENABLE_Pos              (14U)
#define PSSI_CR_ENABLE_Msk              (0x1UL << PSSI_CR_ENABLE_Pos)          /*!< 0x00004000 */
#define PSSI_CR_ENABLE                  PSSI_CR_ENABLE_Msk                     /*!< PSSI enable */
#define PSSI_CR_EDM_Pos                 (10U)
#define PSSI_CR_EDM_Msk                 (0x3UL << PSSI_CR_EDM_Pos)             /*!< 0x00000C00 */
#define PSSI_CR_EDM                     PSSI_CR_EDM_Msk                        /*!< Extended data mode */
#define PSSI_CR_RDYPOL_Pos              (8U)
#define PSSI_CR_RDYPOL_Msk              (0x1UL << PSSI_CR_RDYPOL_Pos)          /*!< 0x00000C00 */
#define PSSI_CR_RDYPOL                  PSSI_CR_RDYPOL_Msk                     /*!< Ready polarity */
#define PSSI_CR_DEPOL_Pos               (6U)
#define PSSI_CR_DEPOL_Msk               (0x1UL << PSSI_CR_DEPOL_Pos)           /*!< 0x00000C00 */
#define PSSI_CR_DEPOL                   PSSI_CR_DEPOL_Msk                      /*!<  Data enable polarity */
#define PSSI_CR_CKPOL_Pos               (5U)
#define PSSI_CR_CKPOL_Msk               (0x1UL << PSSI_CR_CKPOL_Pos)           /*!< 0x00000C00 */
#define PSSI_CR_CKPOL                   PSSI_CR_CKPOL_Msk                      /*!< Parallel data clock polarity */
/********************  Bit definition for PSSI_SR register  *******************/
#define PSSI_SR_RTT1B_Pos               (3U)
#define PSSI_SR_RTT1B_Msk               (0x1UL << PSSI_SR_RTT1B_Pos)           /*!< 0x00000008 */
#define PSSI_SR_RTT1B                   PSSI_SR_RTT1B_Msk                      /*!< Ready to transfer one byte */
#define PSSI_SR_RTT4B_Pos               (2U)
#define PSSI_SR_RTT4B_Msk               (0x1UL << PSSI_SR_RTT4B_Pos)           /*!< 0x00000004 */
#define PSSI_SR_RTT4B                   PSSI_SR_RTT4B_Msk                      /*!< Ready to transfer four bytes */
/********************  Bit definition for PSSI_RIS register  *******************/
#define PSSI_RIS_OVR_RIS_Pos            (1U)
#define PSSI_RIS_OVR_RIS_Msk            (0x1UL << PSSI_RIS_OVR_RIS_Pos)        /*!< 0x00000002 */
#define PSSI_RIS_OVR_RIS                PSSI_RIS_OVR_RIS_Msk                   /*!< Data buffer overrun/underrun raw interrupt status */
/********************  Bit definition for PSSI_IER register  *******************/
#define PSSI_IER_OVR_IE_Pos             (1U)
#define PSSI_IER_OVR_IE_Msk             (0x1UL << PSSI_IER_OVR_IE_Pos)         /*!< 0x00000002 */
#define PSSI_IER_OVR_IE                 PSSI_IER_OVR_IE_Msk                    /*!< Data buffer overrun/underrun interrupt enable */
/********************  Bit definition for PSSI_MIS register  *******************/
#define PSSI_MIS_OVR_MIS_Pos            (1U)
#define PSSI_MIS_OVR_MIS_Msk            (0x1UL << PSSI_MIS_OVR_MIS_Pos)        /*!< 0x00000002 */
#define PSSI_MIS_OVR_MIS                PSSI_MIS_OVR_MIS_Msk                   /*!< Data buffer overrun/underrun masked interrupt status */
/********************  Bit definition for PSSI_ICR register  *******************/
#define PSSI_ICR_OVR_ISC_Pos            (1U)
#define PSSI_ICR_OVR_ISC_Msk            (0x1UL << PSSI_ICR_OVR_ISC_Pos)        /*!< 0x00000002 */
#define PSSI_ICR_OVR_ISC                PSSI_ICR_OVR_ISC_Msk                   /*!< Data buffer overrun/underrun interrupt status clear */
/********************  Bit definition for PSSI_DR register  *******************/
#define PSSI_DR_DR_Pos                  (0U)
#define PSSI_DR_DR_Msk                  (0xFFFFFFFFUL << PSSI_DR_DR_Pos)       /*!< 0xFFFFFFF */
#define PSSI_DR_DR                      PSSI_DR_DR_Msk                         /*!< Data register  */

/******************************************************************************/
/*                                                                            */
/*                                    (PWR)                                   */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for PWR_CR1 register  ********************/
#define PWR_CR1_VDDIO3VMEN_Pos                 (0U)
#define PWR_CR1_VDDIO3VMEN_Msk                 (0x1UL << PWR_CR1_VDDIO3VMEN_Pos)
#define PWR_CR1_VDDIO3VMEN                     PWR_CR1_VDDIO3VMEN_Msk
#define PWR_CR1_USB33VMEN_Pos                  (2U)
#define PWR_CR1_USB33VMEN_Msk                  (0x1UL << PWR_CR1_USB33VMEN_Pos)
#define PWR_CR1_USB33VMEN                      PWR_CR1_USB33VMEN_Msk
#define PWR_CR1_AVMEN_Pos                      (4U)
#define PWR_CR1_AVMEN_Msk                      (0x1UL << PWR_CR1_AVMEN_Pos)
#define PWR_CR1_AVMEN                          PWR_CR1_AVMEN_Msk
#define PWR_CR1_VDDIO3SV_Pos                   (8U)
#define PWR_CR1_VDDIO3SV_Msk                   (0x1UL << PWR_CR1_VDDIO3SV_Pos)
#define PWR_CR1_VDDIO3SV                       PWR_CR1_VDDIO3SV_Msk
#define PWR_CR1_USB33SV_Pos                    (10U)
#define PWR_CR1_USB33SV_Msk                    (0x1UL << PWR_CR1_USB33SV_Pos)           
#define PWR_CR1_USB33SV                        PWR_CR1_USB33SV_Msk                        
#define PWR_CR1_ASV_Pos                        (12U)
#define PWR_CR1_ASV_Msk                        (0x1UL << PWR_CR1_ASV_Pos)
#define PWR_CR1_ASV                            PWR_CR1_ASV_Msk
#define PWR_CR1_VDDIO3RDY_Pos                  (16U)
#define PWR_CR1_VDDIO3RDY_Msk                  (0x1UL << PWR_CR1_VDDIO3RDY_Pos)
#define PWR_CR1_VDDIO3RDY                      PWR_CR1_VDDIO3RDY_Msk
#define PWR_CR1_USB33RDY_Pos                   (18U)
#define PWR_CR1_USB33RDY_Msk                   (0x1UL << PWR_CR1_USB33RDY_Pos)
#define PWR_CR1_USB33RDY                       PWR_CR1_USB33RDY_Msk
#define PWR_CR1_UCPDRDY_Pos                    (19U)
#define PWR_CR1_UCPDRDY_Msk                    (0x1UL << PWR_CR1_UCPDRDY_Pos)
#define PWR_CR1_UCPDRDY                         PWR_CR1_UCPDRDY_Msk
#define PWR_CR1_ARDY_Pos                       (20U)
#define PWR_CR1_ARDY_Msk                       (0x1UL << PWR_CR1_ARDY_Pos)
#define PWR_CR1_ARDY                           PWR_CR1_ARDY_Msk
#define PWR_CR1_VDDIOVRSEL_Pos                 (24U)
#define PWR_CR1_VDDIOVRSEL_Msk                 (0x1UL << PWR_CR1_VDDIOVRSEL_Pos)
#define PWR_CR1_VDDIOVRSEL                     PWR_CR1_VDDIOVRSEL_Msk
#define PWR_CR1_VDDIO3VRSEL_Pos                (25U)
#define PWR_CR1_VDDIO3VRSEL_Msk                (0x1UL << PWR_CR1_VDDIO3VRSEL_Pos)
#define PWR_CR1_VDDIO3VRSEL                    PWR_CR1_VDDIO3VRSEL_Msk
#define PWR_CR1_GPVMO_Pos                      (31U)
#define PWR_CR1_GPVMO_Msk                      (0x1UL << PWR_CR1_GPVMO_Pos)
#define PWR_CR1_GPVMO                          PWR_CR1_GPVMO_Msk

/* Bit fields for PWR_CR2 register */
#define PWR_CR2_MONEN_Pos                      (0U)
#define PWR_CR2_MONEN_Msk                      (0x1UL << PWR_CR2_MONEN_Pos)
#define PWR_CR2_MONEN                          PWR_CR2_MONEN_Msk  /*!< VBAT and temperature monitoring enableWhen set, the VBAT supply and temperature monitoring is enabled.- 0: VBAT and temperature monitoring disabled.- 1: VBAT and temperature monitoring enabled. */
#define PWR_CR2_VBATL_Pos                      (8U)
#define PWR_CR2_VBATL_Msk                      (0x1UL << PWR_CR2_VBATL_Pos)
#define PWR_CR2_VBATL                          PWR_CR2_VBATL_Msk  /*!< Monitored VBAT level above low threshold- 0: VBAT level above low threshold level, or Monitor disabled.- 1: VBAT level equal or below low threshold level. */
#define PWR_CR2_VBATH_Pos                      (9U)
#define PWR_CR2_VBATH_Msk                      (0x1UL << PWR_CR2_VBATH_Pos)
#define PWR_CR2_VBATH                          PWR_CR2_VBATH_Msk  /*!< Monitored VBAT level above high threshold- 0: VBAT level below high threshold level, or Monitor disabled.- 1: VBAT level equal or above high threshold level. */
#define PWR_CR2_TEMPL_Pos                      (10U)
#define PWR_CR2_TEMPL_Msk                      (0x1UL << PWR_CR2_TEMPL_Pos)
#define PWR_CR2_TEMPL                          PWR_CR2_TEMPL_Msk  /*!< Monitored temperature level above low threshold- 0: Temperature above low threshold level, or Monitor disabled.- 1: Temperature equal or below low threshold level. */
#define PWR_CR2_TEMPH_Pos                      (11U)
#define PWR_CR2_TEMPH_Msk                      (0x1UL << PWR_CR2_TEMPH_Pos)
#define PWR_CR2_TEMPH                          PWR_CR2_TEMPH_Msk  /*!< Monitored temperature level above high threshold- 0: Temperature below high threshold level, or Monitor disabled.- 1: Temperature equal or above high threshold level. */

/* Bit fields for PWR_CR3 register */
#define PWR_CR3_PVDEN_Pos                      (0U)
#define PWR_CR3_PVDEN_Msk                      (0x1UL << PWR_CR3_PVDEN_Pos)
#define PWR_CR3_PVDEN                          PWR_CR3_PVDEN_Msk  /*!< Programmable Voltage detector enable.This bit is read only when the SYSCFG register bit PVDL is set. (When PVDL is set, there will be no bus errors generated when writing this register).- 0: Programmable Voltage detector disabled.- 1: Programmable Voltage detector enabled. */
#define PWR_CR3_PVDO_Pos                       (8U)
#define PWR_CR3_PVDO_Msk                       (0x1UL << PWR_CR3_PVDO_Pos)
#define PWR_CR3_PVDO                           PWR_CR3_PVDO_Msk  /*!< Programmable Voltage Detect OutputThis bit is set and cleared by hardware. It is valid only if PVD is enabled by the PVDEN bit.- 0: VDD or voltage level on PVD_IN is equal or higher than the PVD threshold selected with the PLS[2:0] bits.- 1: VDD or voltage level on PVD_IN is lower than the PVD threshold selected with the PLS[2:0] bits.The PVD is disabled in Standby mode and after a system reset. For this reason, this bit is equal to 0 after Standby and system reset. */



/* Bit fields for PWR_CR7 register */
#define PWR_CR7_VDDIO2VMEN_Pos                 (0U)
#define PWR_CR7_VDDIO2VMEN_Msk                 (0x1UL << PWR_CR7_VDDIO2VMEN_Pos)
#define PWR_CR7_VDDIO2VMEN                     PWR_CR7_VDDIO2VMEN_Msk
#define PWR_CR7_VDDIO2SV_Pos                   (8U)
#define PWR_CR7_VDDIO2SV_Msk                   (0x1UL << PWR_CR7_VDDIO2SV_Pos)
#define PWR_CR7_VDDIO2SV                       PWR_CR7_VDDIO2SV_Msk
#define PWR_CR7_VDDIO2RDY_Pos                  (16U)
#define PWR_CR7_VDDIO2RDY_Msk                  (0x1UL << PWR_CR7_VDDIO2RDY_Pos)
#define PWR_CR7_VDDIO2RDY                      PWR_CR7_VDDIO2RDY_Msk
#define PWR_CR7_VDDIO2VRSEL_Pos                (24U)
#define PWR_CR7_VDDIO2VRSEL_Msk                (0x1UL << PWR_CR7_VDDIO2VRSEL_Pos)
#define PWR_CR7_VDDIO2VRSEL                    PWR_CR7_VDDIO2VRSEL_Msk
#define PWR_CR7_VDDIO2VRSTBY_Pos               (25U)
#define PWR_CR7_VDDIO2VRSTBY_Msk               (0x1UL << PWR_CR7_VDDIO2VRSTBY_Pos)
#define PWR_CR7_VDDIO2VRSTBY                   PWR_CR7_VDDIO2VRSTBY_Msk

