STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215axx_ca35.h
/***************  Bit fields for RCC_USB2PHY2CFGR register  ***************/
#define RCC_USB2PHY2CFGR_USB2PHY2RST_Pos           (0U)
#define RCC_USB2PHY2CFGR_USB2PHY2RST_Msk           (0x1UL << RCC_USB2PHY2CFGR_USB2PHY2RST_Pos)          /*!< 0x00000001 */
#define RCC_USB2PHY2CFGR_USB2PHY2RST               RCC_USB2PHY2CFGR_USB2PHY2RST_Msk                    /*!< USB2PHY2 reset */
#define RCC_USB2PHY2CFGR_USB2PHY2EN_Pos            (1U)
#define RCC_USB2PHY2CFGR_USB2PHY2EN_Msk            (0x1UL << RCC_USB2PHY2CFGR_USB2PHY2EN_Pos)           /*!< 0x00000002 */
#define RCC_USB2PHY2CFGR_USB2PHY2EN                RCC_USB2PHY2CFGR_USB2PHY2EN_Msk                   /*!< USB2PHY2 clock enable */
#define RCC_USB2PHY2CFGR_USB2PHY2LPEN_Pos          (2U)
#define RCC_USB2PHY2CFGR_USB2PHY2LPEN_Msk          (0x1UL << RCC_USB2PHY2CFGR_USB2PHY2LPEN_Pos)         /*!< 0x00000004 */
#define RCC_USB2PHY2CFGR_USB2PHY2LPEN              RCC_USB2PHY2CFGR_USB2PHY2LPEN_Msk                   /*!< USB2PHY2 clock enable during CSleep */
#define RCC_USB2PHY2CFGR_USB2PHY2STPEN_Pos         (4U)
#define RCC_USB2PHY2CFGR_USB2PHY2STPEN_Msk         (0x1UL << RCC_USB2PHY2CFGR_USB2PHY2STPEN_Pos)        /*!< 0x00000010 */
#define RCC_USB2PHY2CFGR_USB2PHY2STPEN             RCC_USB2PHY2CFGR_USB2PHY2STPEN_Msk                  /*!< USB2PHY2 reference clock enable during CStop */
#define RCC_USB2PHY2CFGR_USB2PHY2CKREFSEL_Pos      (15U)
#define RCC_USB2PHY2CFGR_USB2PHY2CKREFSEL_Msk      (0x1UL << RCC_USB2PHY2CFGR_USB2PHY2CKREFSEL_Pos)     /*!< 0x00008000 */
#define RCC_USB2PHY2CFGR_USB2PHY2CKREFSEL          RCC_USB2PHY2CFGR_USB2PHY2CKREFSEL_Msk               /*!< USB2PHY2 reference clock select */

/* Bit fields for RCC_STGENCFGR register */
#define RCC_STGENCFGR_STGENEN_Pos                  (1U)
#define RCC_STGENCFGR_STGENEN_Msk                  (0x1UL << RCC_STGENCFGR_STGENEN_Pos)                 /*!< 0x00000002 */
#define RCC_STGENCFGR_STGENEN                      RCC_STGENCFGR_STGENEN_Msk                         /*!< STGENRW and STGENRO clock enable */
#define RCC_STGENCFGR_STGENLPEN_Pos                (2U)
#define RCC_STGENCFGR_STGENLPEN_Msk                (0x1UL << RCC_STGENCFGR_STGENLPEN_Pos)               /*!< 0x00000004 */
#define RCC_STGENCFGR_STGENLPEN                    RCC_STGENCFGR_STGENLPEN_Msk                       /*!< STGENRW and STGENRO clock enable during CSleep */
#define RCC_STGENCFGR_STGENSTPEN_Pos               (4U)
#define RCC_STGENCFGR_STGENSTPEN_Msk               (0x1UL << RCC_STGENCFGR_STGENSTPEN_Pos)              /*!< 0x00000010 */
#define RCC_STGENCFGR_STGENSTPEN                   RCC_STGENCFGR_STGENSTPEN_Msk                      /*!< STGENRW and STGENRO kernel clock enable during CStop */

/* Bit fields for RCC_SDMMC1CFGR register */
#define RCC_SDMMC1CFGR_SDMMC1RST_Pos               (0U)
#define RCC_SDMMC1CFGR_SDMMC1RST_Msk               (0x1UL << RCC_SDMMC1CFGR_SDMMC1RST_Pos)              /*!< 0x00000001 */
#define RCC_SDMMC1CFGR_SDMMC1RST                   RCC_SDMMC1CFGR_SDMMC1RST_Msk                      /*!< SDMMC1 reset */
#define RCC_SDMMC1CFGR_SDMMC1EN_Pos                (1U)
#define RCC_SDMMC1CFGR_SDMMC1EN_Msk                (0x1UL << RCC_SDMMC1CFGR_SDMMC1EN_Pos)               /*!< 0x00000002 */
#define RCC_SDMMC1CFGR_SDMMC1EN                    RCC_SDMMC1CFGR_SDMMC1EN_Msk                       /*!< SDMMC1 clock enable */
#define RCC_SDMMC1CFGR_SDMMC1LPEN_Pos              (2U)
#define RCC_SDMMC1CFGR_SDMMC1LPEN_Msk              (0x1UL << RCC_SDMMC1CFGR_SDMMC1LPEN_Pos)             /*!< 0x00000004 */
#define RCC_SDMMC1CFGR_SDMMC1LPEN                  RCC_SDMMC1CFGR_SDMMC1LPEN_Msk                     /*!< SDMMC1 clock enable during CSleep */
#define RCC_SDMMC1CFGR_SDMMC1DLLRST_Pos            (16U)
#define RCC_SDMMC1CFGR_SDMMC1DLLRST_Msk            (0x1UL << RCC_SDMMC1CFGR_SDMMC1DLLRST_Pos)           /*!< 0x00010000 */
#define RCC_SDMMC1CFGR_SDMMC1DLLRST                RCC_SDMMC1CFGR_SDMMC1DLLRST_Msk                   /*!< SDMMC1 DLL reset */

/* Bit fields for RCC_SDMMC2CFGR register */
#define RCC_SDMMC2CFGR_SDMMC2RST_Pos               (0U)
#define RCC_SDMMC2CFGR_SDMMC2RST_Msk               (0x1UL << RCC_SDMMC2CFGR_SDMMC2RST_Pos)              /*!< 0x00000001 */
#define RCC_SDMMC2CFGR_SDMMC2RST                   RCC_SDMMC2CFGR_SDMMC2RST_Msk                      /*!< SDMMC2 reset */
#define RCC_SDMMC2CFGR_SDMMC2EN_Pos                (1U)
#define RCC_SDMMC2CFGR_SDMMC2EN_Msk                (0x1UL << RCC_SDMMC2CFGR_SDMMC2EN_Pos)               /*!< 0x00000002 */
#define RCC_SDMMC2CFGR_SDMMC2EN                    RCC_SDMMC2CFGR_SDMMC2EN_Msk                       /*!< SDMMC2 clock enable */
#define RCC_SDMMC2CFGR_SDMMC2LPEN_Pos              (2U)
#define RCC_SDMMC2CFGR_SDMMC2LPEN_Msk              (0x1UL << RCC_SDMMC2CFGR_SDMMC2LPEN_Pos)             /*!< 0x00000004 */
#define RCC_SDMMC2CFGR_SDMMC2LPEN                  RCC_SDMMC2CFGR_SDMMC2LPEN_Msk                     /*!< SDMMC2 clock enable during CSleep */
#define RCC_SDMMC2CFGR_SDMMC2DLLRST_Pos            (16U)
#define RCC_SDMMC2CFGR_SDMMC2DLLRST_Msk            (0x1UL << RCC_SDMMC2CFGR_SDMMC2DLLRST_Pos)           /*!< 0x00010000 */
#define RCC_SDMMC2CFGR_SDMMC2DLLRST                RCC_SDMMC2CFGR_SDMMC2DLLRST_Msk                   /*!< SDMMC2 DLL reset */

/* Bit fields for RCC_SDMMC3CFGR register */
#define RCC_SDMMC3CFGR_SDMMC3RST_Pos               (0U)
#define RCC_SDMMC3CFGR_SDMMC3RST_Msk               (0x1UL << RCC_SDMMC3CFGR_SDMMC3RST_Pos)              /*!< 0x00000001 */
#define RCC_SDMMC3CFGR_SDMMC3RST                   RCC_SDMMC3CFGR_SDMMC3RST_Msk                      /*!< SDMMC3 block reset */
#define RCC_SDMMC3CFGR_SDMMC3EN_Pos                (1U)
#define RCC_SDMMC3CFGR_SDMMC3EN_Msk                (0x1UL << RCC_SDMMC3CFGR_SDMMC3EN_Pos)               /*!< 0x00000002 */
#define RCC_SDMMC3CFGR_SDMMC3EN                    RCC_SDMMC3CFGR_SDMMC3EN_Msk                       /*!< SDMMC3 clock enable */
#define RCC_SDMMC3CFGR_SDMMC3LPEN_Pos              (2U)
#define RCC_SDMMC3CFGR_SDMMC3LPEN_Msk              (0x1UL << RCC_SDMMC3CFGR_SDMMC3LPEN_Pos)             /*!< 0x00000004 */
#define RCC_SDMMC3CFGR_SDMMC3LPEN                  RCC_SDMMC3CFGR_SDMMC3LPEN_Msk                     /*!< SDMMC3 clock enable during CSleep */
#define RCC_SDMMC3CFGR_SDMMC3DLLRST_Pos            (16U)
#define RCC_SDMMC3CFGR_SDMMC3DLLRST_Msk            (0x1UL << RCC_SDMMC3CFGR_SDMMC3DLLRST_Pos)           /*!< 0x00010000 */
#define RCC_SDMMC3CFGR_SDMMC3DLLRST                RCC_SDMMC3CFGR_SDMMC3DLLRST_Msk                   /*!< SDMMC3 DLL reset */

/* Bit fields for RCC_LTDCCFGR register */
#define RCC_LTDCCFGR_LTDCRST_Pos                   (0U)
#define RCC_LTDCCFGR_LTDCRST_Msk                   (0x1UL << RCC_LTDCCFGR_LTDCRST_Pos)                  /*!< 0x00000001 */
#define RCC_LTDCCFGR_LTDCRST                       RCC_LTDCCFGR_LTDCRST_Msk                          /*!< LTDC reset */
#define RCC_LTDCCFGR_LTDCEN_Pos                    (1U)
#define RCC_LTDCCFGR_LTDCEN_Msk                    (0x1UL << RCC_LTDCCFGR_LTDCEN_Pos)                   /*!< 0x00000002 */
#define RCC_LTDCCFGR_LTDCEN                        RCC_LTDCCFGR_LTDCEN_Msk                           /*!< LTDC peripheral clock enable */
#define RCC_LTDCCFGR_LTDCLPEN_Pos                  (2U)
#define RCC_LTDCCFGR_LTDCLPEN_Msk                  (0x1UL << RCC_LTDCCFGR_LTDCLPEN_Pos)                 /*!< 0x00000004 */
#define RCC_LTDCCFGR_LTDCLPEN                      RCC_LTDCCFGR_LTDCLPEN_Msk                         /*!< LTDC clock enable during CSleep */

