STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215axx_ca35.h
/******************  Bit definition for SERC_ICR5 register  *******************/
#define SERC_ICR5_PDRC160_Pos        (0U)
#define SERC_ICR5_PDRC160_Msk        (0x1UL << SERC_ICR5_PDRC160_Pos)   /*!< 0x00000001 */
#define SERC_ICR5_PDRC160            SERC_ICR5_PDRC160_Msk
#define SERC_ICR5_PDRC161_Pos        (1U)
#define SERC_ICR5_PDRC161_Msk        (0x1UL << SERC_ICR5_PDRC161_Pos)   /*!< 0x00000002 */
#define SERC_ICR5_PDRC161            SERC_ICR5_PDRC161_Msk
#define SERC_ICR5_PDRC162_Pos        (2U)
#define SERC_ICR5_PDRC162_Msk        (0x1UL << SERC_ICR5_PDRC162_Pos)   /*!< 0x00000004 */
#define SERC_ICR5_PDRC162            SERC_ICR5_PDRC162_Msk
#define SERC_ICR5_PDRC163_Pos        (3U)
#define SERC_ICR5_PDRC163_Msk        (0x1UL << SERC_ICR5_PDRC163_Pos)   /*!< 0x00000008 */
#define SERC_ICR5_PDRC163            SERC_ICR5_PDRC163_Msk
#define SERC_ICR5_PDRC164_Pos        (4U)
#define SERC_ICR5_PDRC164_Msk        (0x1UL << SERC_ICR5_PDRC164_Pos)   /*!< 0x00000010 */
#define SERC_ICR5_PDRC164            SERC_ICR5_PDRC164_Msk
#define SERC_ICR5_PDRC165_Pos        (5U)
#define SERC_ICR5_PDRC165_Msk        (0x1UL << SERC_ICR5_PDRC165_Pos)   /*!< 0x00000020 */
#define SERC_ICR5_PDRC165            SERC_ICR5_PDRC165_Msk
#define SERC_ICR5_PDRC166_Pos        (6U)
#define SERC_ICR5_PDRC166_Msk        (0x1UL << SERC_ICR5_PDRC166_Pos)   /*!< 0x00000040 */
#define SERC_ICR5_PDRC166            SERC_ICR5_PDRC166_Msk
#define SERC_ICR5_PDRC167_Pos        (7U)
#define SERC_ICR5_PDRC167_Msk        (0x1UL << SERC_ICR5_PDRC167_Pos)   /*!< 0x00000080 */
#define SERC_ICR5_PDRC167            SERC_ICR5_PDRC167_Msk
#define SERC_ICR5_PDRC168_Pos        (8U)
#define SERC_ICR5_PDRC168_Msk        (0x1UL << SERC_ICR5_PDRC168_Pos)   /*!< 0x00000100 */
#define SERC_ICR5_PDRC168            SERC_ICR5_PDRC168_Msk
#define SERC_ICR5_PDRC169_Pos        (9U)
#define SERC_ICR5_PDRC169_Msk        (0x1UL << SERC_ICR5_PDRC169_Pos)   /*!< 0x00000200 */
#define SERC_ICR5_PDRC169            SERC_ICR5_PDRC169_Msk
#define SERC_ICR5_PDRC170_Pos        (10U)
#define SERC_ICR5_PDRC170_Msk        (0x1UL << SERC_ICR5_PDRC170_Pos)   /*!< 0x00000400 */
#define SERC_ICR5_PDRC170            SERC_ICR5_PDRC170_Msk
#define SERC_ICR5_PDRC171_Pos        (11U)
#define SERC_ICR5_PDRC171_Msk        (0x1UL << SERC_ICR5_PDRC171_Pos)   /*!< 0x00000800 */
#define SERC_ICR5_PDRC171            SERC_ICR5_PDRC171_Msk
#define SERC_ICR5_PDRC172_Pos        (12U)
#define SERC_ICR5_PDRC172_Msk        (0x1UL << SERC_ICR5_PDRC172_Pos)   /*!< 0x00001000 */
#define SERC_ICR5_PDRC172            SERC_ICR5_PDRC172_Msk
#define SERC_ICR5_PDRC173_Pos        (13U)
#define SERC_ICR5_PDRC173_Msk        (0x1UL << SERC_ICR5_PDRC173_Pos)   /*!< 0x00002000 */
#define SERC_ICR5_PDRC173            SERC_ICR5_PDRC173_Msk
#define SERC_ICR5_PDRC174_Pos        (14U)
#define SERC_ICR5_PDRC174_Msk        (0x1UL << SERC_ICR5_PDRC174_Pos)   /*!< 0x00004000 */
#define SERC_ICR5_PDRC174            SERC_ICR5_PDRC174_Msk
#define SERC_ICR5_PDRC175_Pos        (15U)
#define SERC_ICR5_PDRC175_Msk        (0x1UL << SERC_ICR5_PDRC175_Pos)   /*!< 0x00008000 */
#define SERC_ICR5_PDRC175            SERC_ICR5_PDRC175_Msk
#define SERC_ICR5_PDRC176_Pos        (16U)
#define SERC_ICR5_PDRC176_Msk        (0x1UL << SERC_ICR5_PDRC176_Pos)   /*!< 0x00010000 */
#define SERC_ICR5_PDRC176            SERC_ICR5_PDRC176_Msk
#define SERC_ICR5_PDRC177_Pos        (17U)
#define SERC_ICR5_PDRC177_Msk        (0x1UL << SERC_ICR5_PDRC177_Pos)   /*!< 0x00020000 */
#define SERC_ICR5_PDRC177            SERC_ICR5_PDRC177_Msk
#define SERC_ICR5_PDRC178_Pos        (18U)
#define SERC_ICR5_PDRC178_Msk        (0x1UL << SERC_ICR5_PDRC178_Pos)   /*!< 0x00040000 */
#define SERC_ICR5_PDRC178            SERC_ICR5_PDRC178_Msk
#define SERC_ICR5_PDRC179_Pos        (19U)
#define SERC_ICR5_PDRC179_Msk        (0x1UL << SERC_ICR5_PDRC179_Pos)   /*!< 0x00080000 */
#define SERC_ICR5_PDRC179            SERC_ICR5_PDRC179_Msk
#define SERC_ICR5_PDRC180_Pos        (20U)
#define SERC_ICR5_PDRC180_Msk        (0x1UL << SERC_ICR5_PDRC180_Pos)   /*!< 0x00100000 */
#define SERC_ICR5_PDRC180            SERC_ICR5_PDRC180_Msk
#define SERC_ICR5_PDRC181_Pos        (21U)
#define SERC_ICR5_PDRC181_Msk        (0x1UL << SERC_ICR5_PDRC181_Pos)   /*!< 0x00200000 */
#define SERC_ICR5_PDRC181            SERC_ICR5_PDRC181_Msk
#define SERC_ICR5_PDRC182_Pos        (22U)
#define SERC_ICR5_PDRC182_Msk        (0x1UL << SERC_ICR5_PDRC182_Pos)   /*!< 0x00400000 */
#define SERC_ICR5_PDRC182            SERC_ICR5_PDRC182_Msk
#define SERC_ICR5_PDRC183_Pos        (23U)
#define SERC_ICR5_PDRC183_Msk        (0x1UL << SERC_ICR5_PDRC183_Pos)   /*!< 0x00800000 */
#define SERC_ICR5_PDRC183            SERC_ICR5_PDRC183_Msk
#define SERC_ICR5_PDRC184_Pos        (24U)
#define SERC_ICR5_PDRC184_Msk        (0x1UL << SERC_ICR5_PDRC184_Pos)   /*!< 0x01000000 */
#define SERC_ICR5_PDRC184            SERC_ICR5_PDRC184_Msk
#define SERC_ICR5_PDRC185_Pos        (25U)
#define SERC_ICR5_PDRC185_Msk        (0x1UL << SERC_ICR5_PDRC185_Pos)   /*!< 0x02000000 */
#define SERC_ICR5_PDRC185            SERC_ICR5_PDRC185_Msk
#define SERC_ICR5_PDRC186_Pos        (26U)
#define SERC_ICR5_PDRC186_Msk        (0x1UL << SERC_ICR5_PDRC186_Pos)   /*!< 0x04000000 */
#define SERC_ICR5_PDRC186            SERC_ICR5_PDRC186_Msk
#define SERC_ICR5_PDRC187_Pos        (27U)
#define SERC_ICR5_PDRC187_Msk        (0x1UL << SERC_ICR5_PDRC187_Pos)   /*!< 0x08000000 */
#define SERC_ICR5_PDRC187            SERC_ICR5_PDRC187_Msk
#define SERC_ICR5_PDRC188_Pos        (28U)
#define SERC_ICR5_PDRC188_Msk        (0x1UL << SERC_ICR5_PDRC188_Pos)   /*!< 0x10000000 */
#define SERC_ICR5_PDRC188            SERC_ICR5_PDRC188_Msk
#define SERC_ICR5_PDRC189_Pos        (29U)
#define SERC_ICR5_PDRC189_Msk        (0x1UL << SERC_ICR5_PDRC189_Pos)   /*!< 0x20000000 */
#define SERC_ICR5_PDRC189            SERC_ICR5_PDRC189_Msk
#define SERC_ICR5_PDRC190_Pos        (30U)
#define SERC_ICR5_PDRC190_Msk        (0x1UL << SERC_ICR5_PDRC190_Pos)   /*!< 0x40000000 */
#define SERC_ICR5_PDRC190            SERC_ICR5_PDRC190_Msk
#define SERC_ICR5_PDRC191_Pos        (31U)
#define SERC_ICR5_PDRC191_Msk        (0x1UL << SERC_ICR5_PDRC191_Pos)   /*!< 0x80000000 */
#define SERC_ICR5_PDRC191            SERC_ICR5_PDRC191_Msk

/*****************  Bit definition for SERF_ENABLE register  ******************/
#define SERF_ENABLE_SERFEN_Pos        (0U)
#define SERF_ENABLE_SERFEN_Msk        (0x1UL << SERF_ENABLE_SERFEN_Pos)
#define SERF_ENABLE_SERFEN            SERF_ENABLE_SERFEN_Msk

/******************************************************************************/
/*                                                                            */
/*                              SPDIF-RX Interface                            */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for SPDIF_CR register  ******************/
#define SPDIFRX_CR_SPDIFRXEN_Pos    (0U)
#define SPDIFRX_CR_SPDIFRXEN_Msk    (0x3UL << SPDIFRX_CR_SPDIFRXEN_Pos)        /*!< 0x00000003 */
#define SPDIFRX_CR_SPDIFRXEN        SPDIFRX_CR_SPDIFRXEN_Msk                   /*!<Peripheral Block Enable                      */
#define SPDIFRX_CR_RXDMAEN_Pos      (2U)
#define SPDIFRX_CR_RXDMAEN_Msk      (0x1UL << SPDIFRX_CR_RXDMAEN_Pos)          /*!< 0x00000004 */
#define SPDIFRX_CR_RXDMAEN          SPDIFRX_CR_RXDMAEN_Msk                     /*!<Receiver DMA Enable for data flow            */
#define SPDIFRX_CR_RXSTEO_Pos       (3U)
#define SPDIFRX_CR_RXSTEO_Msk       (0x1UL << SPDIFRX_CR_RXSTEO_Pos)           /*!< 0x00000008 */
#define SPDIFRX_CR_RXSTEO           SPDIFRX_CR_RXSTEO_Msk                      /*!<Stereo Mode                                  */
#define SPDIFRX_CR_DRFMT_Pos        (4U)
#define SPDIFRX_CR_DRFMT_Msk        (0x3UL << SPDIFRX_CR_DRFMT_Pos)            /*!< 0x00000030 */
#define SPDIFRX_CR_DRFMT            SPDIFRX_CR_DRFMT_Msk                       /*!<RX Data format                               */
#define SPDIFRX_CR_PMSK_Pos         (6U)
#define SPDIFRX_CR_PMSK_Msk         (0x1UL << SPDIFRX_CR_PMSK_Pos)             /*!< 0x00000040 */
#define SPDIFRX_CR_PMSK             SPDIFRX_CR_PMSK_Msk                        /*!<Mask Parity error bit                        */
#define SPDIFRX_CR_VMSK_Pos         (7U)
#define SPDIFRX_CR_VMSK_Msk         (0x1UL << SPDIFRX_CR_VMSK_Pos)             /*!< 0x00000080 */
#define SPDIFRX_CR_VMSK             SPDIFRX_CR_VMSK_Msk                        /*!<Mask of Validity bit                         */
#define SPDIFRX_CR_CUMSK_Pos        (8U)
#define SPDIFRX_CR_CUMSK_Msk        (0x1UL << SPDIFRX_CR_CUMSK_Pos)            /*!< 0x00000100 */
#define SPDIFRX_CR_CUMSK            SPDIFRX_CR_CUMSK_Msk                       /*!<Mask of channel status and user bits         */
#define SPDIFRX_CR_PTMSK_Pos        (9U)
#define SPDIFRX_CR_PTMSK_Msk        (0x1UL << SPDIFRX_CR_PTMSK_Pos)            /*!< 0x00000200 */
#define SPDIFRX_CR_PTMSK            SPDIFRX_CR_PTMSK_Msk                       /*!<Mask of Preamble Type bits                   */
#define SPDIFRX_CR_CBDMAEN_Pos      (10U)
#define SPDIFRX_CR_CBDMAEN_Msk      (0x1UL << SPDIFRX_CR_CBDMAEN_Pos)          /*!< 0x00000400 */
#define SPDIFRX_CR_CBDMAEN          SPDIFRX_CR_CBDMAEN_Msk                     /*!<Control Buffer DMA ENable for control flow   */
#define SPDIFRX_CR_CHSEL_Pos        (11U)
#define SPDIFRX_CR_CHSEL_Msk        (0x1UL << SPDIFRX_CR_CHSEL_Pos)            /*!< 0x00000800 */
#define SPDIFRX_CR_CHSEL            SPDIFRX_CR_CHSEL_Msk                       /*!<Channel Selection                            */
#define SPDIFRX_CR_NBTR_Pos         (12U)
#define SPDIFRX_CR_NBTR_Msk         (0x3UL << SPDIFRX_CR_NBTR_Pos)             /*!< 0x00003000 */
#define SPDIFRX_CR_NBTR             SPDIFRX_CR_NBTR_Msk                        /*!<Maximum allowed re-tries during synchronization phase */
#define SPDIFRX_CR_WFA_Pos          (14U)
#define SPDIFRX_CR_WFA_Msk          (0x1UL << SPDIFRX_CR_WFA_Pos)              /*!< 0x00004000 */
#define SPDIFRX_CR_WFA              SPDIFRX_CR_WFA_Msk                         /*!<Wait For Activity     */
#define SPDIFRX_CR_INSEL_Pos        (16U)
#define SPDIFRX_CR_INSEL_Msk        (0x7UL << SPDIFRX_CR_INSEL_Pos)            /*!< 0x00070000 */
#define SPDIFRX_CR_INSEL            SPDIFRX_CR_INSEL_Msk                       /*!<SPDIF input selection */
#define SPDIFRX_CR_CKSEN_Pos        (20U)
#define SPDIFRX_CR_CKSEN_Msk        (0x1UL << SPDIFRX_CR_CKSEN_Pos)            /*!< 0x00100000 */
#define SPDIFRX_CR_CKSEN            SPDIFRX_CR_CKSEN_Msk                       /*!<Symbol Clock Enable */
#define SPDIFRX_CR_CKSBKPEN_Pos     (21U)
#define SPDIFRX_CR_CKSBKPEN_Msk     (0x1UL << SPDIFRX_CR_CKSBKPEN_Pos)         /*!< 0x00200000 */
#define SPDIFRX_CR_CKSBKPEN         SPDIFRX_CR_CKSBKPEN_Msk                    /*!<Backup Symbol Clock Enable */

/*******************  Bit definition for SPDIFRX_IMR register  *******************/
#define SPDIFRX_IMR_RXNEIE_Pos      (0U)
#define SPDIFRX_IMR_RXNEIE_Msk      (0x1UL << SPDIFRX_IMR_RXNEIE_Pos)          /*!< 0x00000001 */
#define SPDIFRX_IMR_RXNEIE          SPDIFRX_IMR_RXNEIE_Msk                     /*!<RXNE interrupt enable                              */
#define SPDIFRX_IMR_CSRNEIE_Pos     (1U)
#define SPDIFRX_IMR_CSRNEIE_Msk     (0x1UL << SPDIFRX_IMR_CSRNEIE_Pos)         /*!< 0x00000002 */
#define SPDIFRX_IMR_CSRNEIE         SPDIFRX_IMR_CSRNEIE_Msk                    /*!<Control Buffer Ready Interrupt Enable              */
#define SPDIFRX_IMR_PERRIE_Pos      (2U)
#define SPDIFRX_IMR_PERRIE_Msk      (0x1UL << SPDIFRX_IMR_PERRIE_Pos)          /*!< 0x00000004 */
#define SPDIFRX_IMR_PERRIE          SPDIFRX_IMR_PERRIE_Msk                     /*!<Parity error interrupt enable                      */
#define SPDIFRX_IMR_OVRIE_Pos       (3U)
#define SPDIFRX_IMR_OVRIE_Msk       (0x1UL << SPDIFRX_IMR_OVRIE_Pos)           /*!< 0x00000008 */
#define SPDIFRX_IMR_OVRIE           SPDIFRX_IMR_OVRIE_Msk                      /*!<Overrun error Interrupt Enable                     */
#define SPDIFRX_IMR_SBLKIE_Pos      (4U)
#define SPDIFRX_IMR_SBLKIE_Msk      (0x1UL << SPDIFRX_IMR_SBLKIE_Pos)          /*!< 0x00000010 */
#define SPDIFRX_IMR_SBLKIE          SPDIFRX_IMR_SBLKIE_Msk                     /*!<Synchronization Block Detected Interrupt Enable    */
#define SPDIFRX_IMR_SYNCDIE_Pos     (5U)
#define SPDIFRX_IMR_SYNCDIE_Msk     (0x1UL << SPDIFRX_IMR_SYNCDIE_Pos)         /*!< 0x00000020 */
#define SPDIFRX_IMR_SYNCDIE         SPDIFRX_IMR_SYNCDIE_Msk                    /*!<Synchronization Done                               */
#define SPDIFRX_IMR_IFEIE_Pos       (6U)
#define SPDIFRX_IMR_IFEIE_Msk       (0x1UL << SPDIFRX_IMR_IFEIE_Pos)           /*!< 0x00000040 */
#define SPDIFRX_IMR_IFEIE           SPDIFRX_IMR_IFEIE_Msk                      /*!<Serial Interface Error Interrupt Enable            */

